RoryT-U/Laser-Drawing/PSoC Code.cydsn/codegentemp/project.h
/*******************************************************************************
* File Name: project.h
* 
* PSoC Creator  4.4
*
* Description:
* It contains references to all generated header files and should not be modified.
* This file is automatically generated by PSoC Creator.
*
********************************************************************************
* Copyright (c) 2007-2020 Cypress Semiconductor.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions, 
* disclaimers, and limitations in the end user license agreement accompanying 
* the software package with which this file was provided.
********************************************************************************/

#include "cyfitter_cfg.h"
#include "cydevice.h"
#include "cydevice_trm.h"
#include "cyfitter.h"
#include "cydisabledsheets.h"
#include "SineWaveX.h"
#include "SineWaveY.h"
#include "X_axis_aliases.h"
#include "X_axis.h"
#include "Y_axis_aliases.h"
#include "Y_axis.h"
#include "Clock_1.h"
#include "LED_aliases.h"
#include "LED.h"
#include "Switch_Input_aliases.h"
#include "Switch_Input.h"
#include "SineWaveX_DacClk.h"
#include "SineWaveX_Wave1_DMA_dma.h"
#include "SineWaveX_Wave2_DMA_dma.h"
#include "SineWaveX_VDAC8.h"
#include "SineWaveX_BuffAmp.h"
#include "SineWaveY_DacClk.h"
#include "SineWaveY_Wave1_DMA_dma.h"
#include "SineWaveY_Wave2_DMA_dma.h"
#include "SineWaveY_VDAC8.h"
#include "SineWaveY_BuffAmp.h"
#include "core_cm3_psoc5.h"
#include "CyDmac.h"
#include "CyFlash.h"
#include "CyLib.h"
#include "cypins.h"
#include "cyPm.h"
#include "CySpc.h"
#include "cytypes.h"
#include "cy_em_eeprom.h"

/*[]*/

